app/controllers/main_controller.rb

	def analyze
		puts 'inside analyze'
		@params = params

		@branches = Cutoff.uniq.pluck(:branch_name)
		@universities = CollegeUniversity.uniq.pluck(:university)
		@caste = Cutoff.uniq.pluck(:cast)

		if params.size <=2
			@cutoffs = Cutoff.where.not(rank_closed: 0, cast: 'AI').order(:marks_closed => :desc).limit(100)
---
SELECT DISTINCT `cutoffs`.`branch_name` FROM `cutoffs`
SELECT DISTINCT `college_universities`.`university` FROM `college_universities`
SELECT DISTINCT `cutoffs`.`cast` FROM `cutoffs`
SELECT `cutoffs`.* FROM `cutoffs` WHERE (`cutoffs`.`rank_closed` != 0) AND (`cutoffs`.`cast` != 'AI') ORDER BY `cutoffs`.`marks_closed` DESC LIMIT 100

				str_caste_arr = "#{str_caste}"
			end

			@cutoffs = Cutoff.where("rank_closed >= ? and rank_closed <= ? and cast IN (?) and branch_name IN (?) and university IN (?)",
				(rank - rank_min), (rank + rank_max), str_caste_arr, branch, university)
---
SELECT `cutoffs`.* FROM `cutoffs` WHERE (rank_closed >= 20000 and rank_closed <= 22000 and cast IN ('GOPENO','GOPENH') and branch_name IN ('Civil Engineering') and university IN ('Mumbai University'))